tinyvision-ai-inc/pico-ice-sdk/example/micro_ros_ws/src/pico-sdk/lib/tinyusb/hw/mcu/nuvoton/nuc505/StdDriver/src/rtc.c
    RTC->TALM = (uint32_t)g_u32Reg;
    RTC_SyncReg();

    u32Reg = RTC->POWCTL | RTC_POWCTL_ALMIEN_Msk;
    RTC->POWCTL =  u32Reg;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief      This function is used to get day of week
 *
 *  @return     Day of Week
 *
 */
uint32_t RTC_GetDayOfWeek(void)
{
    return (RTC->WEEKDAY & RTC_WEEKDAY_WEEKDAY_Msk);
}



/**
 *  @brief      The function is used to set time tick period for periodic time tick Interrupt.
 *
 *  @param[in]  u32TickSelection
 *                       It is used to set the RTC time tick period for Periodic Time Tick Interrupt request.
 *                       It consists of: \n
 *                       - \ref RTC_TICK_1_SEC : Time tick is 1 second        \n
 *                       - \ref RTC_TICK_1_2_SEC : Time tick is 1/2 second    \n
 *                       - \ref RTC_TICK_1_4_SEC : Time tick is 1/4 second    \n
 *                       - \ref RTC_TICK_1_8_SEC : Time tick is 1/8 second    \n
 *                       - \ref RTC_TICK_1_16_SEC : Time tick is 1/16 second  \n
 *                       - \ref RTC_TICK_1_32_SEC : Time tick is 1/32 second  \n
 *                       - \ref RTC_TICK_1_64_SEC : Time tick is 1/64 second  \n
 *                       - \ref RTC_TICK_1_128_SEC : Time tick is 1/128 second
 *
 *  @return     None
 *
 */
void RTC_SetTickPeriod(uint32_t u32TickSelection)
{
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->TICK = (RTC->TICK & ~RTC_TICK_TICKSEL_Msk) | u32TickSelection;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}


/**
 *  @brief      The function is used to enable specified interrupt.
 *
 *  @param[in]  u32IntFlagMask      The structure of interrupt source. It consists of:      \n
 *                                    - \ref RTC_INTEN_ALMIEN_Msk    \n
 *                                     - \ref RTC_INTEN_RALMIEN_Msk  \n
 *                                    - \ref RTC_INTEN_TICKIEN_Msk  \n
 *                                    - \ref RTC_INTEN_PKEYIEN_Msk  \n
 *
 *  @return     None
 *
 */
void RTC_EnableInt(uint32_t u32IntFlagMask)
{
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->INTEN |= u32IntFlagMask;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief      The function is used to disable specified interrupt.
 *
 *  @param[in]  u32IntFlagMask      The structure of interrupt source. It consists of:     \n
 *                                    - \ref RTC_INTEN_ALMIEN_Msk    \n
 *                                    - \ref RTC_INTEN_TICKIEN_Msk  \n
 *                                    - \ref RTC_INTEN_PKEYIEN_Msk  \n
 *
 *  @return    None
 *
 */
void RTC_DisableInt(uint32_t u32IntFlagMask)
{
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    if(u32IntFlagMask & RTC_INTEN_TICKIEN_Msk)
    {
        RTC->INTEN  &= ~RTC_INTEN_TICKIEN_Msk;
        RTC_SyncReg();

        RTC->INTSTS |= RTC_INTSTS_TICKIF_Msk;
        RTC_SyncReg();
    }

    if(u32IntFlagMask & RTC_INTEN_ALMIEN_Msk)
    {
        RTC->INTEN &= ~RTC_INTEN_ALMIEN_Msk;
        RTC_SyncReg();

        RTC->INTSTS |= RTC_INTSTS_ALMIF_Msk;
        RTC_SyncReg();
    }

    if(u32IntFlagMask & RTC_INTEN_PKEYIEN_Msk)
    {
        RTC->INTEN &= ~RTC_INTEN_PKEYIEN_Msk;
        RTC_SyncReg();

        RTC->INTSTS |= RTC_INTSTS_POWKEYIF_Msk;
        RTC_SyncReg();
    }


    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief    Disable RTC clock.
 *
 *  @return   None
 *
 */
void RTC_Close (void)
{
    CLK->APBCLK  &= ~CLK_APBCLK_RTCCKEN_Msk;
}

/**
 *  @brief      This function is used to set relative alarm time to RTC
 *
 *  @param[in]  u32Second   The Second Time Digit of relative Alarm Setting
 *
 *  @return     None
 *
 */
void RTC_SetRelAlarmTime(uint32_t u32Second)
{
    __IO uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->POWCTL =  (RTC->POWCTL & ~(RTC_POWCTL_RALMTIME_Msk | RTC_POWCTL_RALMIEN_Msk));
    RTC_SyncReg();

    u32Reg = (RTC->POWCTL & ~RTC_POWCTL_RALMTIME_Msk)| ((u32Second & 0xFFF) <<RTC_POWCTL_RALMTIME_Pos);
    RTC->POWCTL = u32Reg;
    RTC_SyncReg();

    u32Reg = RTC->POWCTL | RTC_POWCTL_RALMIEN_Msk;
    RTC->POWCTL =  u32Reg;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}


/**
 *  @brief      This function is used to set Power Key active mode and active time
 *
 *  @details    For Level Trigger mode, Power key will be active after Power Key is pressed specified seconds.  \n
 *              But for Edge Trigger mode, it needs to released Power Key to let Power Key active.\n
 *              For example: In Edge Trigger mode, Power Key will not be active if Power Key is always pressed by something else.\n
 *                           Power Key will be active only when Power Key is released (after the specified seconds).
 *
 *  @param[in]  u32Mode      Power Key Active mode\n
 *                                - \ref RTC_TRIGGER_EDGE    \n
 *                                - \ref RTC_TRIGGER_LEVEL  \n
 *  @param[in]  u32Second   Power Key will be active after (u32Second + 1 ) * 0.25 seconds.  \n
 *
 *  @return     None
 *
 */
void RTC_SetPowerOnMode(uint32_t u32Mode, uint32_t u32Second)
{
    __IO uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->POWCTL =  (RTC->POWCTL & ~RTC_POWCTL_EDGE_TRIG_Msk) | u32Mode;
    RTC_SyncReg();

    u32Reg = (RTC->FREQADJ & ~RTC_FREQADJ_PKEYTIME_Msk)| ((u32Second & 0xF) <<RTC_FREQADJ_PKEYTIME_Pos);
    RTC->FREQADJ = u32Reg;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}
/**
 *  @brief      This function is used to get power key status
 *
 *  @return     Status of Power key
 *
 */
uint32_t RTC_GetPowerKeyStatus(void)
{
    __IO uint32_t u32Reg;
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

