tinyvision-ai-inc/pico-ice-sdk/example/micro_ros_ws/src/pico-sdk/lib/tinyusb/hw/mcu/nuvoton/nuc505/StdDriver/src/rtc.c
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    u32Reg = (RTC->POWCTL & RTC_POWCTL_POWKEY_Msk) >> RTC_POWCTL_POWKEY_Pos ;

    RTC->RWEN = 0;
    RTC_SyncReg();

    return u32Reg;
}

/**
 *  @brief      This function is used to set RTC power off
 *
 *  @return     None
 *
 */
void RTC_SetPowerOff(void)
{
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->POWCTL = ((RTC->POWCTL & ~RTC_POWCTL_POWEN_Msk) | RTC_POWCTL_SWPOWOFF_Msk);
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();

    //Disable CPU

    while(1);
}

/**
 *  @brief      This function is used to enable Hardware Power off function and set the trigger time
 *
 *  @details    The function is called software code is out of control and triggered automatically by hardware when software code is out of control.  \n
 *              Push down on RTC "Power Key" and hold it down a specified seconds, NUC505 power off will be power off immediately.
 *
 *  @param[in]  u32Second   Holding Power key (u32Second + 3) seconds to power off
 *
 *  @return     None
 *
 */
void RTC_EnableHardwarePowerOff(uint32_t u32Second)
{
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->POWCTL = ((RTC->POWCTL & ~RTC_POWCTL_POWOFFT_Msk) | RTC_POWCTL_POWOFFEN_Msk | ( (u32Second & 0xF) << RTC_POWCTL_POWOFFT_Pos) );
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/**
 *  @brief    This function is used to disable Hardware Power off function
 *
 *  @return   None
 *
 */
void RTC_DisableHardwarePowerOff(void)
{
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();

    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->POWCTL = RTC->POWCTL & ~RTC_POWCTL_POWOFFEN_Msk;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();

}

/**
 *  @brief      The function is used to set RTC clock source.
 *
 *  @param[in]    u32ClockSource
 *                       It is used to select RTC clock source.
 *                       It consists of: \n
 *                       - \ref RTC_CLKSRC_EXTERNAL  \n
 *                       - \ref RTC_CLKSRC_INTERNAL  \n
 *
 *  @return     None
 *
 */
void RTC_SetClockSource(uint32_t u32ClockSource)
{
    RTC->INIT = RTC_INIT_KEY;
    RTC_SyncReg();
    RTC->RWEN = RTC_WRITE_KEY;
    while(!(RTC->RWEN & RTC_RWEN_RWENF_Msk));
    RTC_SyncReg();

    RTC->CLKSRC = (RTC->CLKSRC & ~RTC_CLKSRC_CKSRC_Msk) | u32ClockSource;
    RTC_SyncReg();

    RTC->RWEN = 0;
    RTC_SyncReg();
}

/*@}*/ /* end of group NUC505_RTC_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC505_RTC_Driver */

/*@}*/ /* end of group NUC505_Device_Driver */

/*** (C) COPYRIGHT 2013 Nuvoton Technology Corp. ***/


